      
      *identification division ******************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID.  hello.
       AUTHOR. Bafode.

      ********************affichage du message***************************
       PROCEDURE DIVISION.
           DISPLAY 'Bonjour comment vous prenommez vous ?' 
           ACCEPT 
           DISPLAY 'Hello, world'.
           STOP RUN.
           