       01  R-ENTETE.
	       03 FILLER PIC X(10)    VALUE 'Matricule '.      
	       03 FILLER PIC X(20)    VALUE 'Nom                 '.      
	       03 FILLER PIC X(20)    VALUE 'Prenom              '.      
	       03 FILLER PIC X(20)    VALUE 'Poste               '.      
	       03 FILLER PIC X(07)    VALUE 'Salaire'.      
	       03 FILLER PIC X(03)    VALUE 'IDT'.      
	       03 FILLER PIC X(26)    VALUE 'Departement               '.      
	       03 FILLER PIC X(27)    VALUE 'Region                     '.      
