           
           FD- TRAIN-HRS
           RECORD VARYING 24 TO 34 CHARACTERS
           DEPENDING ON 
           RECORDING MODE IS V.
         01 ENREG-1  
            03 TYPE-TRAIN        PIC X(3).
            03 DESTINATION-TRAIN PIC X(15).
            03 HEURE-TRAIN       PIC 9(4).
            


               
       